[DS]
PATH=\TWAIN_32\NHII\NH4160\
DSNAME=NH4160.ds
VERSION_INFO=6.20.0908'20
MANUFACTURER=Avision
PRODUCTFAMILY=Scan Manager
PRODUCTNAME=NH4160
INTERFACE=NH4160.dll
UIALWAYSON=0
WARMUPTIMES=1
SAVEPATH=C:\ProgramData\NH4160\
VIDPID=VID_0638&PID_2D3E


[LANGUAGE]
LANGUAGE=Simplified

[Simplified]
&EASY=simple.dll
&BASIC=basic_e.dll
&EXPERT=advance.dll
TWDSM=twdsm_n.dll
SCANMODE=avscan_n.dll
UIDSM=uidsm_n.dll

Err999=找不到设备驱动程序或电源关闭或电缆故障。
Err101=电源关闭或电缆故障。
Err102=请移除扫描仪锁定装置。
Err103=夹纸。
Err104=自动文件进纸器上盖开启。
Err105=自动文件进纸器中没有纸张。
Err106=检测到工作分离单张。
Err107=要使用扫描透明胶片功能，您必须先安装扫描透明胶片套件。
Err108=透明胶片套件开关关闭。
Err109=内部目标故障。
Err110=保险丝熔断。
Err111=保险丝熔断。
Err112=保险丝熔断。
Err113=保险丝熔断。
Err114=机械系统故障。
Err115=光学系统故障。
Err116=不合规定的扫描仪参数。
Err117=不合规定的扫描仪参数。
Err118=不合规定的扫描仪参数。
Err119=不合规定的扫描仪参数。
Err120=不合规定的扫描仪参数。
Err121=讯息错误。
Err122=图像传输错误。
Err123=未知的错误。
Err124=找不到任何 ASPI 管理器。
Err125=找不到 SCSI ASPI。
Err126=一个不支持视窗的常驻 ASPI 管理器。
Err127=内存不足。
Err128=找不到 winaspi.dll 或 wnaspi32.dll。
Err129=找不到扫描仪。
Err130=找不到初始化的 SCSI 管理器。
Err150=驱动程序忙碌中.
Err151=无效的扫描仪参数.
Err152=配置内存失败.
Err153=Driver initial fails.
Err154=扫描仪起始化失败.
Err155=扫描仪连结失败.
Err156=读取图像错误.
Err157=读取图像错误.
Err158=End Image Error.
Err159=按下停止键后, 扫描中断。
Err160=Driver initial fails.
Err161=Sending scanner parameter fails.
Err162=扫描仪忙碌中.
Err163=Sending command error.
Err164=扫描仪暖机中.
Err165=Power off.
Err170=Parallel not found.
Err171=扫描仪连结失败.
Err172=扫描仪连结失败.
Err173=扫描仪连结失败.
Err174=扫描仪起始化失败.
Err175=扫描仪起始化失败.
Err176=Back to home position fails or scanner lock error.
Err177=寻找起始位置失败.
Err178=Lamp can not be turned on.
Err179=扫描仪锁定装置关闭。
Err180=Interrupt error.
Err181=Bad pixel.
Err182=row data value too low.
Err183=row data value too high.
Err184=end of page.
Err185=Wrong chart.
Err186=For storing rear page of interlace duplex scan.
Err187=重迭进纸。
Err188=Accessaries such as ADF was pluged out.
Err189=end of page with multi feed occured.
Err190=Flatbed Home Sensor Error.
Err191=ADF Home Sensor Error.
Err192=Flatbed DRAM Error.
Err193=ADF DRAM Error.
Err194=Flatbed Lamp Error.
Err195=ADF Lamp Error.
Err196=Flatbed cover open.
Err250=系统错误.
Err251=Driver Internal Error.
Err2000=驱动程序忙碌中.
Err2001=扫描仪忙碌中.
Err2002=IO port is busy.
Err2003=HandShake Time Out.
Err2004=扫描仪连结失败.
Err2005=无效的扫描仪参数.
Err2006=配置内存失败.
Err2007=无法开启灯管。
Err2008=扫描仪锁定装置关闭。
Err2009=扫描仪暖机中.
Err2010=按下停止键后, 扫描中断。
Err2011=Register R/W verification failed.
Err2012=Memory R/W verification failed.
Err2013=夹纸。
Err2014=自动文件进纸器上盖开启。
Err2015=自动文件进纸器中没有纸张。
Err2016=要使用扫描透明胶片功能，您必须先安装扫描透明胶片套件。
Err2017=透明胶片套件开关关闭。
Err2018=找不到 winaspi.dll 或 wnaspi32.dll。
Err2019=找不到扫描仪。
Err2020=扫描仪校正失败。
Err2021=无法回到起始点。
Err2022=End of page.
Err2023=操作系统错误.
Err2028=Endorser - ADF Cover Open.
Err2029=Endorser - Paper Jam.
Err2030=The ADF slider cover is not closed.
Err2031=Read prepare date failed.
Err2032=Wait media into scanner.
Err2040=风扇错误。
Err2041=扫描仪暖机中
Err2044=检测到装订文件。
Err2999=未知的错误。
Err3001=平台原点侦测失败。
Err3002=自动进纸器原点侦测失败。
Err3003=平台式随机内存失败。
Err3004=自动进纸器随机内存失败。
Err3005=平台灯管错误。
Err3006=自动进纸器灯管错误。
Err3007=平台文件上盖开启。
Err3101=重迭进纸。
Err2027=End of page with multi feed occurred.
IDS_LOWMEMORY=出现低内存状态。请释放一些内存然后再试一次。
IDS_NOPAPER=自动文件进纸器中没有纸张。
IDS_NOPAPER1=请装入纸张，然后再试一次。
IDS_NODISK=磁盘空间不足。
IDS_NODISK1=请整理磁盘然后再试一次。
IDS_WRITEERROR=写入文件错误。
IDS_WRITEERROR1=这可能是因为：
IDS_WRITEERROR2=1.) 磁盘已满
IDS_WRITEERROR3=2.) 磁盘写入保护
IDS_WRITEERROR4=请再检查。
IDS_TRANSFER=传输
IDS_CHUNKY=大块数据及传输
IDS_MEMORY_P=缓冲内存/P
IDS_MEMORY_C=缓冲内存/C
IDS_NATIVE=原始内存。
IDS_NATIVE_P=原始内存/P
IDS_DISK=磁盘文件
IDS_DISK_P=磁盘文件/P
IDS_MEMORY=缓冲内存
IDS_SCAN=扫描中...
IDS_PREVIEW=预览...
IDS_TESTSCANNER=扫描测试
IDS_CONNECTING=连接扫描仪
IDS_CANCEL=取消
IDS_TRANSFERMODE=传输模式:
CaliTitle=校准中...
IDS_PUTPAPERMSG=请将校正卡放入扫描仪中。
IDS_WAIT=请稍候...
IDS_BADSIZE=扫描大小 < 64 象素或 0.5 英寸
IDS_BADWIDTH=扫描的宽度太大了
IDS_EASYUI=此界面将转换为 EASY（简易）版本。
IDS_PRINTWORKING=正在处理一些打印工作，请稍候至所有打印工作完成。
IDS_SCANNERSUCCESS=扫描仪连接成功！
IDS_SCANNERFALSE=扫描仪连接中断！
IDS_SCANNERUNKNOW=扫描仪状态不名！
IDS_ENERGY=关闭"扫描仪工具"将关闭"节省能量"设置
IDS_WARING=警告
IDS_ERRORCODE=错误代码
IDS_CHANGEMODE=要使用扫描透明胶片功能，您必须先安装扫描透明胶片套件。
IDS_PRINTWORKING=正在处理一些打印工作。请稍候至所有打印工作完成。
IDS_CONNECTSUCCESS=扫描仪连接成功！
IDS_CONNECTFAILURE=扫描仪故障！
IDS_CONNECTUNKNOW=扫描仪状态不名！
IDS_WARMUP=扫描仪灯尚未准备好...
IDS_SECOND=秒
IDS_WAIT=请稍候...
WARMUPTITLE=扫描仪热机
MATCHFILE=找不到颜色校正文件。
IDS_TRANSFERRING=正在传送...
IDS_SCANNINGPAGETEXT=扫描页数
IDS_ELAPSED=经过时间:
IDS_RECEIVED=接收大小:
IDS_TOTALRECEIVED=共接收大小:
IDS_MULTIFEED=重迭进纸动作，请将纸张全部从自动进纸器中清除。
IDS_MULTIFEEDAUTO=重迭进纸动作
IDS_FILETYPEERROR=应用软件不接受压缩格式
IDS_PAPERDETECTION=纸张侦测
IDS_PUTPAPER=纸张置入自动文件进纸器中.
IDS_TIMEREMAIN=剩余时间:
IDS_CONTINUESCANNING=继续扫描下一张？
IDS_PAPERONSCANNER=请放置纸张到扫描仪上
IDS_WAITNEXTJOB=扫描工作等待中...
IDS_INTELLIGENTSKIP=请按"确认"键,扫描仪会在下次扫描时会跳过此重叠进纸状况。
PREPAREDATATITLE=校准中...
IDS_PREPAREDATA=执行第一次使用之设置...
IDS_CONTINUE=继续
IDS_STOP=结束
IDS_SCANSTOP=不再扫描，请按"结束"。
IDS_SCANCONTINUE=要扫描下页，点击"继续"。
IDS_FAILEDVIRTUALSCANNER=无法连接虚拟扫描仪。
IDS_PUTPAPERSCAN=继续扫描，请重新将文件放入自动进纸器内。
IDS_ENABLEUI=启用使用者介面
IDS_CONTINUESCAN=继续扫描
IDS_DISCARDIMAGE=继续扫描(删除此张)
IDS_STOPSCAN=中断扫描

Err3025=Please Insert the Calibration Card
Err2028=If you wish to scan without auto feeder, please move the ADF slider at the rear of the scanner to the left side.
Err3400=Card Length >2.5 Inch

Err7001=Degeneracy error(Front side of ADF)
Err7002=Degeneracy error(Back side of ADF)
Err7003=Degeneracy error(ADF)
Err7004=Degeneracy error(Flatbed)
Err7005=Degeneracy error(Printer)
Err7006=Degeneracy error(Multifeed)

Err2033=自动进纸纸张歪斜。
Err2036=超声波错误。
Err2037=AFE R/W test error.
Err3201=校准失败。
Err3002=校准失败(leading edge).
Err3003=校准失败(side edge).
Err3004=校准失败(shading target edge).
Err3205=夹纸。
Err3206=夹纸。
Err3207=夹纸。
Err3208=抓纸和分纸轮错误.
Err3010=自动进纸器灯管错误。
Err3211=自动进纸遗漏纸张。

[UI Version]
UI Num=3
0=&EASY
1=&BASIC
2=&EXPERT

[&EASY]
function=CreateSimpleDialog
Curve=0

[&BASIC]
function=_CreateBasicDialog
Curve=0

[&EXPERT]
function=CreateAdvanceDialog
Curve=1
